Run python -m pip install mysqlclient pymysql from your terminal to install the mysql client (any folder is fine)
cd into your exercises folder for this module and run echo env.py >> .gitignore
Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.
Use your function to obtain a connection to the employees database.
Once you have successfully run a query:
Intentionally make a typo in the database url. What kind of error message do you see?
Intentionally make an error in your SQL query. What does the error message look like?
Read the employees and titles tables into two separate DataFrames.
How many rows and columns do you have in each DataFrame? Is that what you expected?
Display the summary statistics for each DataFrame.
How many unique titles are in the titles DataFrame?
What is the oldest date in the to_date column?
What is the most recent date in the to_date column?

In [36]:
import pandas as pd
import numpy as np

In [17]:
from env import host, user, password, get_db_url

url = get_db_url('employees')

In [12]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [ ]:
# error in the URL will produce an Operational Error
url = f'mysql+pymysql://{user}:{password}@{host}/employes'
    #(OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'mirzakhani_1931'@'%' to database 'employes'")

In [ ]:
# error in the query will produce an ProgrammingError: 
pd.read_sql('SELECT * FROM emplyees LIMIT 5 OFFSET 50', url)
    # ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.emplyees' doesn't exist")
#[SQL: SELECT * FROM emplyees LIMIT 5 OFFSET 50]

In [14]:
# Read the employees and titles tables into two separate DataFrames.
pd.DataFrame = pd.read_sql('SELECT * FROM employees',url)

In [18]:
employees_read = pd.DataFrame

In [19]:
pd.DataFrame = pd.read_sql('SELECT * FROM titles',url)

In [38]:
titles_read = pd.DataFrame
titles_read

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

In [27]:
# How many rows and columns do you have in each DataFrame? Is that what you expected?
    # employees has 300024 rows and 6 columns
    # titles has 443308 rows and 4 columns
employees_read.shape

(300024, 6)

In [28]:
titles_read.shape

(443308, 4)

In [25]:
# Display the summary statistics for each DataFrame.
employees_read.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [26]:
titles_read.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [43]:
# How many unique titles are in the titles DataFrame?
    # There are 7 unique titles
titles_read.title.unique()
len(titles_read.title.unique())

7

In [33]:
titles_read.columns

Index(['emp_no', 'title', 'from_date', 'to_date'], dtype='object')

In [46]:
# What is the oldest date in the to_date column?
    # date 1985 - 3 -1, (year, month, day)
titles_read.to_date.min()

datetime.date(1985, 3, 1)

In [47]:
# What is the most recent date in the to_date column?
    # date 9999 - 1 - 1, (year, month,day)
titles_read.to_date.max()

datetime.date(9999, 1, 1)